---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceOffsetPosParam
source: html/0875ec78-7af4-41c8-6a41-582fecc681b5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceOffsetPosParam Property

"Moves With Nearby Elements"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceOffsetPosParam { get; }
```